# Bar Terminations Data Crank Type Id At End Property

Source: https://www.revitapidocs.com/2026/8b7932b6-70cb-a8c0-08b0-84f496e82909.htm

---

| Bar Terminations Data Crank Type Id At End Property |
| --- |

Identifies the crank type at the end of bar.
 Setting this property to a valid value, will set the HookTypeIdAtEnd and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId CrankTypeIdAtEnd { get; set; }
```

```
Public Property CrankTypeIdAtEnd As ElementId
	Get
	Set
```

```
public:
property ElementId^ CrankTypeIdAtEnd {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member CrankTypeIdAtEnd : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: crankTypeIdAtEnd doesn't represent a crank type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace